homework/Lab07/combustorRhoPimple/constant/thermophysicalProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    
    dpdt yes; 

    specie
    {
        molWeight   28.9;
    }

    thermodynamics
    {
        Cp          1004;
        Cv          712;
        Hf          0;
    }

    transport
    {
        mu          1.8e-05;
        Pr          0.7;
    }
}

