homework/Lab07/combustorRhoPimple/0/alphat
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      alphat;
}

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    "(splitter|back|sides)"
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    fuel_inlet
    {
        type            calculated;
        value           uniform 0;
    }

 // back
 // {
 //     type            nutkWallFunction;
 //     value           uniform 0;
 // }

 // sides
 // {
 //     type            nutkWallFunction;
 //     value           uniform 0;
 // }

    frontAndBack
    {
        type            empty;
    }
}

